OpenFOAM/libAcoustics-OF4.1/cases/FFWH+cfdbem_1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime; //latestTime;

startTime       0;

stopAt          endTime;

endTime         0.1;

deltaT          2.5e-6;

writeControl    adjustableRunTime;

writeInterval   5e-3;

purgeWrite      200;

writeFormat     ascii;

writePrecision  9;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.5;

maxDeltaT       1e-5;

CourantType	cellCourant;

//libs ("libcompressibleTools.so");

functions
{
	include "soundPressureSampling"
        include "probeControl"
        include "fwhControl"
        include "sphereAverage"        
}

// ************************************************************************* //
