OpenFOAM/libAcoustics-OF4.1/cases/FFWH+cfdbem_1D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    free
    {
        type            patch;
        nFaces          1;
        startFace       1199;
    }
    cyc1
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1200;
        startFace       1200;
    }
    cyc2
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1200;
        startFace       2400;
    }
    cyc3
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1200;
        startFace       3600;
    }
    cyc4
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1200;
        startFace       4800;
    }
    sphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       6000;
    }
)

// ************************************************************************* //
